Utyff/stm32f0_usb_msd/usb_lib/usb_defs.h
#include <stm32f0xx.h>

#define USB               		((USB_TypeDef *) (0x40005C00))
#define USB_BTABLE_BASE			0x40006000
#define USB_BTABLE				((USB_BtableDef *)(USB_BTABLE_BASE))
#define USB_CNTR_CTRM			0x00008000
#define USB_CNTR_PMAOVRM		0x00004000
#define USB_CNTR_ERRM			0x00002000
#define USB_CNTR_WKUPM			0x00001000
#define USB_CNTR_SUSPM			0x00000800
#define USB_CNTR_RESETM			0x00000400
#define USB_CNTR_SOFM			0x00000200
#define USB_CNTR_ESOFM			0x00000100
#define USB_CNTR_L1REQM			0x00000080
#define USB_CNTR_L1RESUME		0x00000020
#define USB_CNTR_RESUME			0x00000010
#define USB_CNTR_FSUSP			0x00000008
#define USB_CNTR_LP_MODE		0x00000004
#define USB_CNTR_PWDN			0x00000002
#define USB_CNTR_FRES			0x00000001
#define USB_ISTR_CTR			0x00008000
#define USB_ISTR_PMAOVR			0x00004000
#define USB_ISTR_ERR			0x00002000
#define USB_ISTR_WKUP			0x00001000
#define USB_ISTR_SUSP			0x00000800
#define USB_ISTR_RESET			0x00000400
#define USB_ISTR_SOF			0x00000200
#define USB_ISTR_ESOF			0x00000100
#define USB_ISTR_L1REQ			0x00000080
#define USB_ISTR_DIR			0x00000010
#define USB_ISTR_EPID			0x0000000F
#define USB_FNR_RXDP			0x00008000
#define USB_FNR_RXDM			0x00004000
#define USB_FNR_LCK				0x00002000
#define USB_FNR_LSOF			0x00001800
#define USB_FNR_LSOF_0			0x00000800
#define USB_FNR_lSOF_1			0x00001000
#define USB_FNR_FN				0x000007FF
#define USB_DADDR_EF			0x00000080
#define USB_DADDR_ADD			0x0000007F
#define USB_LPMCSR_BESL			0x000000F0
#define USB_LPMCSR_BESL_0		0x00000010
#define USB_LPMCSR_BESL_1		0x00000020
#define USB_LPMCSR_BESL_2		0x00000040
#define USB_LPMCSR_BESL_3		0x00000080
#define USB_LPMCSR_REMWAKE		0x00000008
#define USB_LPMCSR_LPMACK		0x00000002
#define USB_LPMCSR_LPMEN		0x00000001
#define USB_BCDR_DPPU			0x00008000
#define USB_BCDR_PS2DET			0x00000080
#define USB_BCDR_SDET			0x00000040
#define USB_BCDR_PDET			0x00000020
#define USB_BCDR_DCDET			0x00000010
#define USB_BCDR_SDEN			0x00000008
#define USB_BCDR_PDEN			0x00000004
#define USB_BCDR_DCDEN			0x00000002
#define USB_BCDR_BCDEN			0x00000001
#define USB_EPnR_CTR_RX			0x00008000
#define USB_EPnR_DTOG_RX		0x00004000
#define USB_EPnR_STAT_RX		0x00003000
#define USB_EPnR_STAT_RX_0		0x00001000
#define USB_EPnR_STAT_RX_1		0x00002000
#define USB_EPnR_SETUP			0x00000800
#define USB_EPnR_EP_TYPE		0x00000600
#define USB_EPnR_EP_TYPE_0		0x00000200
#define USB_EPnR_EP_TYPE_1		0x00000400
#define USB_EPnR_EP_KIND		0x00000100
#define USB_EPnR_CTR_TX			0x00000080
#define USB_EPnR_DTOG_TX		0x00000040
#define USB_EPnR_STAT_TX		0x00000030
#define USB_EPnR_STAT_TX_0		0x00000010
#define USB_EPnR_STAT_TX_1		0x00000020
#define USB_EPnR_EA				0x0000000F
#define USB_COUNTn_RX_BLSIZE	0x00008000
#define USB_COUNTn_NUM_BLOCK	0x00007C00
#define USB_COUNTn_RX			0x0000003F

typedef struct{
	__IO uint32_t EPnR[8];
	__IO uint32_t RESERVED1;
	__IO uint32_t RESERVED2;
	__IO uint32_t RESERVED3;
	__IO uint32_t RESERVED4;
	__IO uint32_t RESERVED5;
	__IO uint32_t RESERVED6;
	__IO uint32_t RESERVED7;
	__IO uint32_t RESERVED8;
	__IO uint32_t CNTR;
	__IO uint32_t ISTR;
	__IO uint32_t FNR;
	__IO uint32_t DADDR;
	__IO uint32_t BTABLE;
	__IO uint32_t LPMCSR;
	__IO uint32_t BCDR;
} USB_TypeDef;

typedef struct{
	__IO uint16_t USB_ADDR_TX;
	__IO uint16_t USB_COUNT_TX;
	__IO uint16_t USB_ADDR_RX;
	__IO uint16_t USB_COUNT_RX;
} USB_EPDATA_TypeDef;

typedef struct{
	__IO USB_EPDATA_TypeDef EP[8];
} USB_BtableDef;
